app/views/tasks/show.html.erb


<% unless @task.task_locks.empty? %>
---
SELECT COUNT(*) FROM `task_locks` WHERE (`task_locks`.task_id = 5)
SELECT `task_locks`.* FROM `task_locks` WHERE (`task_locks`.task_id = 5) LIMIT 1