app/controllers/members_controller.rb

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 5 LIMIT 1
SELECT `members`.* FROM `members` WHERE (`members`.project_id = 5)
---
  def index
    @project = Project.find(params[:project_id])
    @members = @project.members.all

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 5 LIMIT 1
SELECT `projects`.*, `projects`.`id` FROM `projects` INNER JOIN `members` ON `projects`.id = `members`.project_id WHERE `projects`.`id` = 8 AND ((`members`.user_id = 3)) LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def add
    @project = Project.find(params[:project_id])
    @users = User.all.collect {|user| user unless user.projects.include?(@project) }.compact!

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 5 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def new
    @project = Project.find(params[:project_id])
    @user = User.find(params[:user_id])

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 5 LIMIT 1
INSERT INTO `members` (`project_id`, `user_id`, `member_role_id`, `title`, `created_at`, `updated_at`) VALUES (5, NULL, 3, 'Lomailija', '2011-04-20 21:14:00', '2011-04-20 21:14:00')
---
  def create
    @project = Project.find(params[:project_id])
    @member = @project.members.new(params[:member])

    respond_to do |format|
      if @member.save