app/controllers/projects_controller.rb

SELECT `projects`.* FROM `projects` WHERE `projects`.`visibility` = 'public'
---
  def index
    @projects = Project.all(:conditions => {:visibility => "Public"})

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
SELECT `members`.* FROM `members` WHERE `members`.`id` = 1 AND (`members`.project_id = 8) LIMIT 1
SELECT `tasks`.* FROM `tasks` WHERE (`tasks`.project_id = 8) ORDER BY status, priority, deadline
---
  def show
    @project = Project.find(params[:id])
    @members = @project.members.all
    @tasks = @project.tasks.all(:order => "status, priority, deadline")

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
---
  def edit
    @project = Project.find(params[:id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
INSERT INTO `projects` (`name`, `url`, `description`, `visibility`, `deadline`, `created_at`, `updated_at`) VALUES ('Tietokantasovellus', NULL, 'Helsingin yliopiston tietojenkäsittelytieteen laitoksen aineopintojen kurssin Tietokantasovellus projekti.', NULL, NULL, '2011-04-06 19:37:14', '2011-04-06 19:37:14')
INSERT INTO `members` (`project_id`, `user_id`, `member_role_id`, `title`, `created_at`, `updated_at`) VALUES (4, 3, 1, NULL, '2011-04-14 16:13:51', '2011-04-14 16:13:51')
SELECT `member_roles`.* FROM `member_roles` WHERE `member_roles`.`role` = 'creator' LIMIT 1
SELECT `members`.`id` FROM `members` WHERE `members`.`user_id` = 1 AND (`members`.`project_id` = 9) LIMIT 1
---
  def create
    @project = Project.new(params[:project])
    user = User.find_by_id(session[:user_id])

    respond_to do |format|
      if @project.save
        @project.members.create(:user_id => user.id, :member_role_id => MemberRole.find_or_create_by_role("creator"))

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
UPDATE `projects` SET `description` = 'Helsingin yliopiston tietojenkäsittelytieteen laitoksen aineopintojen kurssin Tietokantasovellus projekti.', `url` = '', `deadline` = '2011-10-07 00:00:00', `updated_at` = '2011-04-07 18:30:22' WHERE `projects`.`id` = 1
---
  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 6 LIMIT 1
DELETE FROM `projects` WHERE `projects`.`id` = 3
---
  def destroy
    @project = Project.find(params[:id])
    @project.destroy