app/controllers/task_locks_controller.rb

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 8 LIMIT 1
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 5 LIMIT 1
INSERT INTO `task_locks` (`task_id`, `user_id`, `created_at`, `updated_at`) VALUES (NULL, 3, '2011-09-17 18:54:54', '2011-09-17 18:54:54')
---
  def create
    @project = Project.find(params[:project_id])
    @task = Task.find(params[:task_id])
    @lock = @task.task_locks.new(params[:task_lock])

    respond_to do |format|
      if @lock.save