app/controllers/tasks_controller.rb

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 5 LIMIT 1
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 5 AND (`tasks`.project_id = 5) LIMIT 1
---
  def show
    @project = Project.find(params[:project_id])
    @task = @project.tasks.find(params[:id])

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 5 LIMIT 1
---
  def new
    @project = Project.find(params[:project_id])

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 5 LIMIT 1
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1 AND (`tasks`.project_id = 5) LIMIT 1
---
  def edit
    @project = Project.find(params[:project_id])
    @task = @project.tasks.find(params[:id])

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 5 LIMIT 1
INSERT INTO `tasks` (`project_id`, `description`, `priority`, `status`, `deadline`, `comment`, `created_at`, `updated_at`, `name`) VALUES (5, 'Kesäiset kossufestarit puistossa, joissa Kristian maksaa mulle kossun.', 1, 'pending', '2011-06-16 18:00:00', '', '2011-04-20 15:59:21', '2011-04-20 15:59:21', 'Kossufestarit')
---
  def create
    @project = Project.find(params[:project_id])
    @task = @project.tasks.new(params[:task])

    respond_to do |format|
      if @task.save

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 5 LIMIT 1
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1 AND (`tasks`.project_id = 5) LIMIT 1
UPDATE `tasks` SET `description` = 'Kesäiset kossufestarit puistossa, joissa Kristian maksaa mulle kossun.', `deadline` = '2011-06-11 18:00:00', `updated_at` = '2011-04-20 17:13:54' WHERE `tasks`.`id` = 1
---
  def update
    @project = Project.find(params[:project_id])
    @task = @project.tasks.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 8 LIMIT 1
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 7 AND (`tasks`.project_id = 8) LIMIT 1
DELETE FROM `tasks` WHERE `tasks`.`id` = 7
---
  def destroy
    @project = Project.find(params[:project_id])
    @task = @project.tasks.find(params[:id])
    @task.destroy