app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `projects`.* FROM `projects` INNER JOIN `members` ON `projects`.id = `members`.project_id WHERE ((`members`.user_id = 1))
---
  def show
    @user = User.find(params[:id])
    @projects = @user.projects.all

INSERT INTO `users` (`username`, `email`, `password_salt`, `encrypted_password`, `created_at`, `updated_at`, `user_role_id`) VALUES ('testi2', '', '21627134200.06460033732430448', 'f51f92d4782c605c8f49450aafc1acd0e144236b1e4e992484f6b5255badff72', '2011-04-14 23:02:09', '2011-04-14 23:02:09', NULL)
SELECT `user_roles`.* FROM `user_roles` WHERE `user_roles`.`role` = 'user' LIMIT 1
---
  def create
    @user = User.new(params[:user])
    @user.user_role = UserRole.find_or_create_by_role("user")

SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 6
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy