app/views/members/_form.html.erb

  	<%= f.label :member_role_id %>
	<%= f.select(:member_role_id, MemberRole.find_or_create_roles) %>
---
INSERT INTO `member_roles` (`role`, `created_at`, `updated_at`) VALUES ('user', '2011-04-21 13:45:33', '2011-04-21 13:45:33')